<script>
export default {}
</script>

<template>
  <div class="container">
    <div class="project">
      <h1>О проекте</h1>
        <p>          Открытый университет РГППУ – это новый проект центра развития образовательных проектов Университета, который рассматривается как модель неформального образования взрослых. </p>
        <p> Университеты в нашем отечестве во все времена решали задачи не только профессиональной подготовки студентов, но являлись центрами науки, культуры, просвещения в своих регионах. «Открытый университет» создан для выполнения РГППУ этой важной миссии на неформальной основе. Удовлетворяя потребности населения в повышении образовательного и культурного уровня в рамках образовательного проекта, РГППУ решает задачу повышения собственного имиджа в регионе и за его пределами, привлечения в университет потенциальных студентов. Задачи отдельных курсов, организуемых «Открытым университетом», определяются не только их непосредственным содержанием, но и запросами слушателей.</p>
        <p>Идея проекта «Открытого Университета» связана с возрождением культуры дискуссий по ключевым проблемам современного гуманитарного знания, находящихся в центре процессов развития страны. РГППУ — выступает как инициатор цикла публичных видиолекций, c одновременной их трансляцией в пространстве Интернет для широкого круга заинтересованных участников. Проект предполагает активное участие студенческого и профессорско-преподавательского сообщества в Екатеринбурге и Свердловской области, а также всех профессиональных и общественных групп, испытывающих интерес к проблематике современного гуманитарного знания.</p>
        <p>Цель проекта «Открытого университета» - формирование нового образа Университета как лидера современных разработок и сценариев гуманитарного действия, соразмерного сегодняшней региональной, национальной и мировой ситуации.</p>
    </div>
    <div class="mission">
      <h1>Наша миссия</h1>
      <p>Современный этап общественного развития, часто называемый «обществом знания», характеризуется пониманием того факта, что постоянно развивающееся и обновляющееся знание является условием социально-экономического развития общества в целом и фактором сохранения и развития активности каждого человека. Сущность современных концепций непрерывного образования заключается в обосновании необходимости постоянного обучения человека в течение всей жизни, т. е. на всех возрастных этапах.</p>
      <p>Миссия «Открытого Университета» – совершенствование процессов обучения, обеспечивающие непрерывное повышение квалификации сотрудников, формирование современных компетенций, необходимых для разработки и реализации конкурентоспособных, высокотехнологичных образовательных продуктов. </p>
      <h1>Принципы работы "Открытого университета"</h1>
      <p>В реализации образовательного проекта используются современные технологические, цифровые решения. Разработана образовательная платформа, где используются различные формы донесения важной информации, о краткосрочных и стратегических планах РГППУ непосредственно от руководства и сотрудников Университета. Это позволяет приобрести новые профессиональные компетенции, настроить лояльность к Университету.</p>
      <p>Высокий уровень профессионализма преподавателей, который проявляется не только в профессиональных знаниях и умениях, но способности обучать и просвещать людей взрослых, стимулировать и поддерживать познавательную мотивацию слушателей.</p>
      <p>Демократический характер управления и самоуправление – еще одна особенность работы «Открытого университета». Регулярно проводятся небольшие анкетирования для оценки слушателями организации работы и качества предлагаемых образовательных продуктов, а также для внесения предложений по совершенствованию деятельности «Открытого университета». </p>
      <p>Главная задача инициативы – рост количества преподавателей, осуществляющих инновационную образовательную деятельность; рост уровня профессиональной подготовки руководителей подразделений Университета к внедрению современных механизмов управления (в том числе финансово-экономических механизмов). Инициатива также предусматривает совершенствование организации образовательного процесса, использование современных технологий и инструментов мотивации обучающихся, повышения качества подготовки специалистов.</p>
      <p>Эти форматы помогают развитию преподавательских компетенций участников инициативы, способствуют разработке современных учебно-методических материалов (кейс-технологии, демонстрационные материалы) по актуальным тематикам, изложенные с практической точки зрения.</p>
      <p>Помимо образовательного аспекта в проекте особое внимание уделяется социально-коммуникативным вопросам, направленным на внутренние коммуникации. Налаживание взаимоотношений по горизонтали управления процессами, развитие духовно-нравственного аспекта корпоративной культуры Университета.</p>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.container {
  width: 80%;
  margin: 0px auto;
  display: flex;
  flex-direction: column;

  .project,
  .mission {
    display: flex;
    flex-direction: column;
    margin: 45px 0;
    gap: 40px;
    h1 {
      font-family: 'Open Sans';
      font-style: normal;
      font-weight: 700;
      font-size: 36px;
      text-transform: uppercase;
    }
    p {
      font-style: normal;
      font-weight: 400;
      font-size: 24px;
      text-align: justify;
      word-wrap: normal;
      text-indent: 80px;
      }
  }
}
@media (min-width: 2559px) {
  .container {
    .project,
    .mission {
      h1 {
        font-size: 4rem;
      }
      p {
        font-size: 2.5rem;
      }
    }
  }
}
</style>
